package com.example.today_workout_complete;

public class Study_record {
    
    
    //221107
    //jpa강의 실전예제 h2db 연동 오류 수정 및 해결완료했고 예제 클론코딩중
    //jpa강의 실전예제 1차 완료
    
    //221109 실전예제 1차 수정
    //221110 연관관계 매핑 1차
    //221111 연관관계 매핑 실전예제 완료
    //manytoone 관계
    //연관관계 매핑 2단계 완료
    //다양한 연관관계 매핑 완료
    //스프링부트 복습 시작\
    //도메인설계 복습
    //엔티티 클래스개발
    //엔티티 클래스개발2
    //엔티티 클래스개발 실전예제
    //엔티티 설계 주의사항
    //회원레포지토리 개발
    //상품 서비스, 레퍼지토리 개발
    //주문 설계
    //주문설계2
    //상품 엔티티 개발
    //주문기능스트
    //주문검색
    //웹기능구현1
    //웹화면구현1
}
